[
    {
        "id": 1,
        "name": "Apartamento Central",
        "price": 1200,
        "description": "Um apartamento luxuoso no centro da cidade, ideal para quem busca conforto e comodidade. Com 140 metros quadrados, oferece espaços amplos e bem iluminados, distribuídos em 2 quartos, 2 casas de banho e uma sala de estar moderna. A cozinha está equipada com eletrodomésticos de última geração e acabamentos de alta qualidade. Além disso, possui acesso fácil a restaurantes, lojas e transporte público.",
        "category": "Arrendar",
        "location": "Porto",
        "imageUrl": "./assets/house-02.jpeg",
        "imageGallery": [
            "./assets/house-03.jpeg",
            "./assets/house-04.jpeg",
            "./assets/house-05.jpeg",
            "./assets/house-06.jpeg"
        ],
        "meters": "140",
        "wc": "2",
        "rooms": "2"
    },
    {
        "id": 2,
        "name": "Residência Familiar",
        "price": 320000,
        "description": "Uma casa espaçosa ideal para uma família que valoriza conforto e qualidade de vida. Com 200 metros quadrados, esta residência possui 4 quartos amplos, 3 casas de banho modernas e uma cozinha totalmente equipada. A sala de estar é perfeita para momentos de convívio, com uma lareira acolhedora e acesso ao jardim privado. Localizada em Lisboa, está próxima de escolas, parques e serviços essenciais, tornando-se a escolha perfeita para quem busca um lar tranquilo na cidade.",
        "category": "Comprar",
        "location": "Lisboa",
        "imageUrl": "./assets/house-03.jpeg",
        "imageGallery": [
            "./assets/house-07.jpeg",
            "./assets/house-08.jpeg",
            "./assets/house-09.jpeg",
            "./assets/house-02.jpeg"
        ],
        "meters": "200",
        "wc": "3",
        "rooms": "4"
    },
    {
        "id": 3,
        "name": "Estúdio Moderno",
        "price": 900,
        "description": "Estúdio moderno e confortável, ideal para solteiros ou jovens casais. Com 50 metros quadrados, este espaço compacto oferece uma cozinha funcional, uma área de dormir confortável e uma casa de banho bem equipada. Localizado em Coimbra, proporciona fácil acesso às universidades, cafés e centros culturais. Perfeito para quem deseja uma vida prática e urbana, sem abrir mão do conforto.",
        "category": "Arrendar",
        "location": "Coimbra",
        "imageUrl": "./assets/house-04.jpeg",
        "imageGallery": [
            "./assets/house-05.jpeg",
            "./assets/house-06.jpeg",
            "./assets/house-07.jpeg",
            "./assets/house-08.jpeg"
        ],
        "meters": "50",
        "wc": "1",
        "rooms": "1"
    },
    {
        "id": 4,
        "name": "Moradia Luxuosa",
        "price": 550000,
        "description": "Moradia luxuosa com piscina e jardim privado, situada na bela região do Algarve. Com 300 metros quadrados, esta propriedade oferece 5 quartos espaçosos, 4 casas de banho elegantes e uma cozinha gourmet. A sala de estar é ampla e luminosa, com acesso direto ao terraço e à área da piscina. O jardim paisagístico proporciona um ambiente relaxante e exclusivo. Ideal para quem busca uma vida de luxo e tranquilidade junto à costa.",
        "category": "Comprar",
        "location": "Algarve",
        "imageUrl": "./assets/house-05.jpeg",
        "imageGallery": [
            "./assets/house-09.jpeg",
            "./assets/house-02.jpeg",
            "./assets/house-03.jpeg",
            "./assets/house-04.jpeg"
        ],
        "meters": "300",
        "wc": "4",
        "rooms": "5"
    },
    {
        "id": 5,
        "name": "Apartamento Moderno",
        "price": 1500,
        "description": "Apartamento moderno com vista para o rio, localizado numa das zonas mais desejadas do Porto. Com 120 metros quadrados, dispõe de 3 quartos, 2 casas de banho e uma cozinha equipada com eletrodomésticos modernos. A sala de estar é espaçosa e tem uma varanda com uma vista incrível para o rio. Ideal para quem deseja viver com estilo e ter fácil acesso a todas as comodidades da cidade.",
        "category": "Arrendar",
        "location": "Porto",
        "imageUrl": "./assets/house-06.jpeg",
        "imageGallery": [
            "./assets/house-08.jpeg",
            "./assets/house-09.jpeg",
            "./assets/house-02.jpeg",
            "./assets/house-03.jpeg"
        ],
        "meters": "120",
        "wc": "2",
        "rooms": "3"
    },
    {
        "id": 6,
        "name": "Casa de Campo",
        "price": 230000,
        "description": "Casa de campo tranquila com terreno amplo, situada na pitoresca região do Minho. Com 180 metros quadrados, esta propriedade oferece 3 quartos confortáveis, 2 casas de banho modernas e uma cozinha espaçosa. A sala de estar é aconchegante, com uma lareira tradicional. O grande terreno ao redor da casa é perfeito para atividades ao ar livre e jardinagem. Ideal para quem busca um refúgio tranquilo no campo, sem abrir mão do conforto.",
        "category": "Comprar",
        "location": "Minho",
        "imageUrl": "./assets/house-07.jpeg",
        "imageGallery": [
            "./assets/house-04.jpeg",
            "./assets/house-05.jpeg",
            "./assets/house-06.jpeg",
            "./assets/house-07.jpeg"
        ],
        "meters": "180",
        "wc": "2",
        "rooms": "3"
    },
    {
        "id": 7,
        "name": "Apartamento T2",
        "price": 1100,
        "description": "Apartamento T2 com excelente localização em Lisboa. Com 100 metros quadrados, dispõe de 2 quartos, uma casa de banho moderna e uma cozinha totalmente equipada. A sala de estar é confortável e bem iluminada, perfeita para relaxar após um dia de trabalho. Próximo a transportes públicos, lojas e restaurantes, este apartamento é ideal para quem deseja viver no coração da cidade.",
        "category": "Arrendar",
        "location": "Lisboa",
        "imageUrl": "./assets/house-08.jpeg",
        "imageGallery": [
            "./assets/house-09.jpeg",
            "./assets/house-02.jpeg",
            "./assets/house-03.jpeg",
            "./assets/house-04.jpeg"
        ],
        "meters": "100",
        "wc": "1",
        "rooms": "2"
    },
    {
        "id": 8,
        "name": "Vivenda com Vista Mar",
        "price": 450000,
        "description": "Vivenda com vista deslumbrante para o mar, situada na prestigiada área de Cascais. Com 250 metros quadrados, esta casa oferece 4 quartos espaçosos, 3 casas de banho elegantes e uma cozinha moderna. A sala de estar é luminosa e tem acesso a um terraço com vistas panorâmicas do oceano. O jardim bem cuidado e a área de churrasco são perfeitos para entretenimento ao ar livre. Ideal para quem deseja uma vida de luxo com vistas espetaculares.",
        "category": "Comprar",
        "location": "Cascais",
        "imageUrl": "./assets/house-09.jpeg",
        "imageGallery": [
            "./assets/house-02.jpeg",
            "./assets/house-03.jpeg",
            "./assets/house-04.jpeg",
            "./assets/house-05.jpeg"
        ],
        "meters": "250",
        "wc": "3",
        "rooms": "4"
    }
]
